Repository: marvinheintze/Niryo_Ned_Vision_Pick
Catalog: src/sphinx_doc/locale/*/LC_MESSAGES/source/stack_hardware/conveyor_interface.po
Languages: fr

source: This package handles Niryo's Conveyor Belt.
fr: Ce package gère le Convoyeur Niryo.

source: You can control two Conveyors Belt.
fr: Il est possible de contrôler jusqu'à deux Convoyeurs.

source: Conveyor Belt interface node
fr: Noeud de l'interface Convoyeur

source: The ROS Node is made to:
fr: Le nœud ROS est conçu pour :

source: Initialize Conveyor Belt motor parameters.
fr: Initialiser les paramètres du moteur du Convoyeur.

source: Set and control Conveyors Belt.
fr: Régler et contrôler le Convoyeur.

source: Publish Conveyors Belt state.
fr: Diffuser l'état du Convoyeur.

source: The namespace used is: |namespace_emphasize|
fr: L'espace de nom utilisé est |namespace_emphasize|

source: Parameters - Conveyor Belt interface
fr: Paramètres - Interface Convoyeur

source: Conveyor Belt Interface's Parameters
fr: Paramètres de l'interface Convoyeur

source: Name
fr: Nom

source: Publishes rate for conveyors state.
fr: Diffuser le taux pour l'état des convoyeurs

source: Default: '2.0'
fr: Par défault : '2.0'

source: Published topics - Conveyor Belt interface
fr: Topics diffusés - Interface Convoyeur

source: Conveyor Belt Interface's Published Topics
fr: Topics diffusés de l'interface Convoyeur

source: Message Type
fr: Type du message

source: Conveyors Belt states
fr: État du Convoyeur

source: Services - Conveyor Belt interface
fr: Services - Interface Convoyeur

source: Conveyor Belt Interface Package Services
fr: Services du package de l'interface Convoyeur

source: Sends a command to the desired Conveyor Belt
fr: Envoyer une commande au Convoyeur souhaité

source: Scans and sets a new Conveyor Belt
fr: Scanner et définir un nouveau Convoyeur

source: Dependencies - Conveyor Belt interface
fr: Dépendances - Interface Convoyeur

source: Services & messages files - Conveyor Belt interface
fr: Fichiers de services et de messages - Interface Convoyeur
