Repository: marvinheintze/Niryo_Ned_Vision_Pick
Catalog: src/sphinx_doc/locale/*/LC_MESSAGES/source/stack_hardware/cpu_interface.po
Languages: fr

source: This package handles CPU states.
fr: Ce package gère les statuts CPU.

source: CPU interface node
fr: Noeud de l'interface CPU

source: The ROS Node is made to:
fr: Le nœud ROS est conçu pour :

source: monitor CPU temperature.
fr: Surveiller la température du CPU.

source: Parameters - CPU interface
fr: Paramètres - Interface CPU

source: CPU Interface's Parameters
fr: Paramètres de l'interface CPU

source: Name
fr: Nom

source: Publishes rate for CPU temperature
fr: Taux de diffusion pour l'interface CPU

source: Default: '0.25'
fr: Par défault : '0.25'

source: CPU temperature [celsius] threshold before a warn message
fr: Seuil de température du CPU [celsius] avant un message d'avertissement

source: Default: '75'
fr: Par défault : '75'

source: CPU temperature [celsius] threshold before shutdown the robot
fr: Seuil de température du CPU [celsius] avant l'arrêt du robot

source: Default: '85'
fr: Par défault : '85'
