Repository: marvinheintze/Niryo_Ned_Vision_Pick
Catalog: src/sphinx_doc/locale/*/LC_MESSAGES/source/stack_hardware/joints_interface.po
Languages: fr

source: This package handles packages related to the robot's joints controller.
fr: Ce package gère les packages liés au contrôleur des axes du robot.

source: It provides an interface to :wiki_ros:`ros_control`.
fr: Il fournit une interface à :wiki_ros:`ros_control`.

source: Joints interface node
fr: Nœud de 'joints interface'

source: The ROS Node is made to:
fr: Le nœud ROS est conçu pour :

source: Interface robot's motors to joint trajectory controller, from :wiki_ros:`ros_control` package.
fr: Interfacer les moteurs du robot au contrôleur de trajectoire articulaire, à partir du package :wiki_ros:`ros_control`.

source: Create a controller manager, from :wiki_ros:`controller_manager` package, provides the infrastructure to load, unload, start and stop controllers.
fr: Créer un gestionnaire de contrôle, à partir du package :wiki_ros:`controller_manager`, pour fournir l'infrastructure nécessaire pour charger, décharger, démarrer et arrêter les contrôleurs.

source: Interface with motors calibration.
fr: Interfacer avec calibration des moteurs.

source: Initialize motors parameters.
fr: Initialiser des paramètres moteurs.

source: Parameters - joints interface
fr: Paramètres - 'joints interface'

source: Joint Interface's Parameters
fr: Paramètres de 'joints interface'

source: Name
fr: Nom

source: Controls loop frequency.
fr: Fréquence de la boucle de contrôle

source: Default: '100.0'
fr: Par défault : '100.0'

source: Publishes rate for learning mode state.
fr: Taux de diffusion pour l'état du mode d'apprentissage

source: Default: '2.0'
fr: Par défault : '2.0'

source: Waiting time between 2 commands during the calibration process.
fr: Temps d'attente entre 2 commandes pendant la calibration

source: Default: '30'
fr: Par défault : '30'

source: File directory where is saved motors calibration value.
fr: Répertoire de fichiers où est enregistrée la valeur de calibration des moteurs

source: Default: '/home/niryo/niryo_robot_saved_files/stepper_motor_calibration_offsets.txt'
fr: Par défault : '/home/niryo/niryo_robot_saved_files/stepper_motor_calibration_offsets.txt'

source: Published topics - joints interface
fr: Topics diffusés - Interface axes

source: Joint Interface's Published Topics
fr: Topics publiés par 'joints interface'

source: Message Type
fr: Type du message

source: Learning mode state
fr: État du mode apprentissage

source: Services - joints interface
fr: Services - Interface axes

source: Joint Interface Package Services
fr: Services du package 'joints interface'

source: Starst motors calibration - value can be 1 for auto calibration, 2 for manual
fr: Démarrer la calibration des moteurs - la valeur peut être 1 pour la calibration automatique, 2 pour la calibration manuelle

source: Unsets motors calibration
fr: Désactiver la calibration des moteurs

source: Either activates or deactivates learning mode
fr: Activer ou désactiver le mode d'apprentissage

source: Dependencies - joints interface
fr: Dépendances - Interface axes
