Repository: marvinheintze/Niryo_Ned_Vision_Pick
Catalog: src/sphinx_doc/locale/*/LC_MESSAGES/source/stack_hardware/niryo_robot_debug.po
Languages: fr

source: This package offers scripts to change ping/scan DXL motors and changes register values of these motors.
fr: Ce package propose des scripts pour modifier les scans des DXL et les valeurs de registre de ces moteurs.

source: Niryo robot - Send DXL custom value
fr: Robot Niryo - Envoyer une valeur personnalisée DXL

source: This script can be launched via: ::
fr: Ce script peut être lancé via : ::

source: Parameters - Send DXL custom value
fr: Paramètres - Envoyer une valeur personnalisée DXL

source: **--type [Number]:** Motor type (3 for XL-320, 2 for XL-430)
fr: **--type [Number]:** Type de moteur (3 pour XL-320, 2 pour XL-430)

source: **--id [Number]:** Motor ID
fr: **--id [Number]:** ID du moteur

source: **--address [Number]:** Register address to modify
fr: **--address [Number]:** Registre d'adresse à modifier

source: **--value [Number]:** Value to store at the register address given
fr: **--value [Number]:** Valeur à conserve dans le registre d'adresse donné

source: **--size [Number]:** Size in bytes of the value given
fr: **--size [Number]:** Taille en octets de la valeur donnée

source: Niryo robot - Dxl debug tools
fr: Robot Niryo - Outils de débogage DXL

source: Parameters - Dxl debug tools
fr: Paramètres - Outils de débogage DXL

source: **--help / -h:** Print help message
fr: **--help / -h:** Imprime un message d'aide

source: **--baudrate / -b [Number]:** Baudrate (1000000 by default)
fr: **--baudrate / -b [Number]:** Baud (1000000 by default)

source: **--port / -p [Number]:** Set port
fr: **--port / -p [Number]:** Définir le port

source: **--id / -i [Number]:** Dxl motor ID (0 by default)
fr: **--id / -i [Number]:** ID du moteur Dynamixel (0 by default)

source: **--scan:** Scan all Dxl motors on the bus
fr: **--scan:** Scan tous les moteurs Dynamixel sur le bus

source: **--ping:** Ping specific ID
fr: **--ping:** Ping un ID spécifique

source: **--set-register [Number] [Number] [Number]:** Set a value to a register, parameters are in the order: register address / value / size (in bytes) of the value
fr: **--set-register [Number] [Number] [Number]:** Définir une valeur à enregister, les paramètres sont à mettre dans cet ordre : indiquez l'adresse / la valeur / la taille (en octet) de la valeur
