Repository: marvinheintze/Niryo_Ned_Vision_Pick
Catalog: src/sphinx_doc/locale/*/LC_MESSAGES/source/ros/niryo_robot_unit_tests.po
Languages: fr

source: This package provides config and launches files to start Ned unit tests.
fr: Ce paquet fournit des fichiers de configuration et de lancement pour démarrer les tests unitaires Ned.

source: Currently, tested packages are:
fr: Actuellement, les packages testés sont :

source: Run tests with launch file
fr: Exécuter des tests avec le fichier de lancement

source: Using a launch file make the task easy as you do not have to bother about your current directory. Nevertheless, it starts a roscore, and so, the process won't end as "/rosout" will be still alive. To overcome this issue, the test node is set as **required**, so do not worry if you see some red lines at the execution's end.
fr: L'utilisation d'un fichier de lancement facilite la tâche car vous n'avez pas à vous soucier de votre répertoire actuel. Néanmoins, il lance un roscore, et donc, le processus ne se terminera pas car "/rosout" sera toujours en vie. Pour résoudre ce problème, le nœud de test est défini comme **requis**, ne vous inquiétez donc pas si vous voyez des lignes rouges à la fin de l'exécution.

source: Launch file with Rviz
fr: Lancer le fichier avec Rviz

source: It will start the ROS Stack and Rviz, then run the tests: ::
fr: Il démarrera la stack ROS et Rviz, puis exécutera les tests : ::

source: Launch file with Gazebo
fr: Lancer le fichier avec Gazebo

source: It will start the ROS Stack and Gazebo, then run the tests. Gazebo add Physics, Gripper and Camera to the tests: ::
fr: Il démarrera la stack ROS et Gazebo, puis exécutera les tests. Gazebo ajoute la physique, le Gripper et la Caméra aux tests : ::

source: Launch file Headless
fr: Lancer le fichier Headless

source: It will start the ROS Stack then run the tests in a headless version (no display). It is very useful for CI purposes: ::
fr: Il démarrera la stack ROS puis exécutera les tests dans une version Headless (sans affichage). Il est très utile à des fins de CI : ::

source: Run tests With Python file
fr: Exécuter des tests avec un fichier Python

source: Using a python file implies to use the correct relative directory, but it also allows to get status code at the end of the script.
fr: L'utilisation d'un fichier python implique d'utiliser le bon répertoire relatif, mais il permet également d'obtenir l'état du code à la fin du script.

source: Python file with Rviz
fr: Fichier Python avec Rviz

source: Python file with Gazebo
fr: Fichier Python avec Gazebo

source: Python file Headless
fr: Fichier Python Headless
