Repository: marvinheintze/Niryo_Ned_Vision_Pick
Catalog: src/sphinx_doc/locale/*/LC_MESSAGES/source/ros_wrapper.po
Languages: fr

source: Control with Python ROS Wrapper
fr: Contrôler avec Python ROS Wrapper

source: Python Logo
fr: Logo Python

source: In order to control Ned more easily than calling each topics & services one by one, a Python ROS Wrapper has been built on top of ROS.
fr: Afin de contrôler Ned plus facilement que d'appeler chaque topics & service un par un, un Python ROS Wrapper a été construit au-dessus de ROS.

source: For instance, a script realizing a moveJ via Python ROS Wrapper will look like: ::
fr: Par exemple, un script réalisant un moveJ via Python ROS Wrapper ressemblera à : ::

source: What this code is doing in a hidden way:
fr: Ce que fait ce code de manière cachée :

source: It generates a :ref:`RobotMove Action Goal<source/ros/niryo_robot_arm_commander:RobotMove (Action)>` and set it as a joint command with the corresponding joints value.
fr: Il génère un :ref:`RobotMove Action Goal<source/ros/niryo_robot_arm_commander:RobotMove (Action)>` et le définit comme une commande conjointe avec la valeur d'articulation correspondante.

source: Sends goal to the Commander Action Server.
fr: Envoyer l'objectif au Arm Commander Action Server.

source: Waits for the Commander Action Server to set Action as finished.
fr: Attendre que le Commander Action Server définisse l'action comme terminée.

source: Checks if action finished with a success.
fr: Vérifier si l'action s'est terminée avec succès.

source: In this section, we will give some examples on how to use the Python ROS Wrapper to control Ned, as well as a complete documentation of the functions available in the Ned Python ROS Wrapper.
fr: Dans cette section, nous donnerons quelques exemples sur la façon d'utiliser le Python ROS Wrapper pour contrôler Ned, ainsi qu'une documentation complète des fonctions disponibles dans le Python ROS Wrapper de Ned.

source: The Python ROS Wrapper forces the user to write his code directly in the robot, or, at least, copy the code on the robot via a terminal command. If you do not want that, and run code directly from your computer you can use the python Package :ref:`source/more:PyNiryo`.
fr: Le Python ROS Wrapper oblige l'utilisateur à écrire son code directement dans le robot, ou, du moins, à copier le code sur le robot via une commande de terminal. Si vous ne le souhaitez pas et exécutez le code directement à partir de votre ordinateur, vous pouvez utiliser le package :ref:`source/more:PyNiryo`.

source: Section Contents:
fr: Contenu de la section :
