Repository: marvinheintze/Niryo_Ned_Vision_Pick
Catalog: src/sphinx_doc/locale/*/LC_MESSAGES/source/simulation.po
Languages: fr

source: Use Niryo robot through simulation
fr: Utilisation du robot Niryo via la simulation

source: The simulation allows to control a virtual Ned directly from your computer.
fr: La simulation permet de contrôler virtuellement Ned depuis votre ordinateur.

source: Ned in Gazebo Simulation
fr: Ned dans la simulation de Gazebo

source: In this tutorial, you will learn how to setup simulation on a computer.
fr: Avec ce tutoriel, apprenez à configurer une simulation sur un ordinateur.

source: You can use :niryo_studio_simulation:`Niryo Studio with the simulation<>`. To do so, you just have to connect Niryo Studio to "Localhost".
fr: Il est possible d'utiliser :niryo_studio_simulation:`Niryo Studio avec la simulation<>`. Pour cela il vous suffit de connecter Niryo Studio en "Localhost".

source: Simulation environment installation
fr: Installation de l'environnement de simulation

source: The whole ROS Stack is developed and tested on ROS **Melodic** which requires **Ubuntu 18.04** to run correctly. The using of another ROS version or OS may lead to malfunctions of some packages.
fr: L'ensemble de la stack ROS est développée et testée sur ROS **Melodic** qui nécessite **Ubuntu 18.04** pour fonctionner correctement. L'utilisation d'une autre version de ROS ou d'un autre système d'exploitation peut entraîner les dysfonctionnements de certains packages.

source: To allow the simulation to run on your computer, you will need to install ROS and some packages.
fr: Pour permettre à la simulation de s'exécuter sur votre ordinateur, il faut installer ROS et certains packages supplémentaires.

source: Installation index:
fr: Index d'installation :

source: Prepare environment
fr: Préparer l'environnement

source: All terminal command listed are for Ubuntu users.
fr: Toutes les commandes répertoriées du terminal sont destinées aux utilisateurs d'Ubuntu.

source: Place yourself in the folder of your choice and create a folder **catkin_ws_niryo_ned** as well as a sub-folder **src**: ::
fr: Il faut se placer dans le dossier de votre choix et créer un dossier **catkin_ws_niryo_ned** ainsi qu'un sous-dossier **src** : ::

source: Then go to the folder **catkin_ws_niryo_ned** and clone Ned repository in the folder **src**. For the future operation, be sure to stay in the **catkin_ws_niryo_ned** folder: ::
fr: Ensuite il faut aller dans le dossier **catkin_ws_niryo_ned** et cloner le dépôt Ned dans le dossier **src**. Pour l'opération suivante, il est important de rester dans le dossier **catkin_ws_niryo_ned** : ::

source: Install ROS dependencies
fr: Installer les dépendances ROS

source: Install ROS
fr: Installer ROS

source: You firstly need to install ROS Melodic. To do so, follow the ROS official tutorial `here <http://wiki.ros.org/melodic/Installation/Ubuntu>`_ and chose the **Desktop-Full Install**.
fr: Tout d'abord il faut installer ROS Melodic. Pour ce faire, il est nécessaire de suivre le tutoriel officiel ROS disponible `ici <http://wiki.ros.org/melodic/Installation/Ubuntu>`_ et de choisir l'**installation complète du bureau**.

source: Install additional packages
fr: Installer des packages supplémentaires

source: To ensure the functioning of all Ned's packages, you need to install several more packages:
fr: Pour garantir le bon fonctionnement de tous les packages de Ned, il est nécessaire d’installer plusieurs autres packages :

source: Method 1: Quick installation via ROSDep
fr: Méthode 1 : installation rapide via ROSDep

source: For each packages, we have referenced all the dependencies in their respective *package.xml* file, which allow to install each dependency via *rosdep* command: ::
fr: Pour chaque package, nous avons référencé toutes les dépendances dans leur fichier *package.xml* respectif, ce qui permet d'installer chaque dépendance via la commande *rosdep* :

source: Method 2: Full installation
fr: Méthode 2 : installation complète

source: ROS packages needed are:
fr: Les packages ROS indispensables sont :

source: To install a package on Ubuntu: ::
fr: Pour installer un package sur Ubuntu :

source: Melodic specific packages needed are:
fr: Les packages Melodic spécifiques nécessaires sont :

source: To install a ROS Melodic's package on Ubuntu: ::
fr: Pour installer un package de ROS Melodic sur Ubuntu :

source: Setup Ned ROS environment
fr: Configurer l'environnement Ned ROS

source: Be sure to be still placed in the **catkin_ws_niryo_ned** folder.
fr: Il est important de toujours être placé dans le dossier **catkin_ws_niryo_ned**

source: Then perform the **make** of Ned's ROS Stack via the command: ::
fr: Ensuite, il faut effectuer la **création** de la stack ROS de Ned via la commande :

source: If no errors occurred during the **make** phase, the setup of your environment is almost complete!
fr: Si aucune erreur ne s'est produite lors de la phase de **création**, la configuration de votre environnement est presque terminée !

source: It is necessary to source the configuration file to add all Ned packages to ROS environment. To do so, run the command: ::
fr: Il est nécessaire de se procurer le fichier de configuration pour ajouter tous les packages Ned à l'environnement ROS. Pour ce faire, exécutez la commande : ::

source: It is necessary to run this command each time you launch a new terminal. If you want to make this sourcing appends for all your futur terminals, you can add it to your **bashrc** file: ::
fr: Il est nécessaire d'exécuter cette commande à chaque lancement depuis un nouveau terminal. Pour ajouter ce sourcing à tous vos futurs terminaux, ajouter le sourcing à votre fichier **bashrc** : ::

source: Installation is now finished!
fr: L'installation est maintenant terminée !

source: Simulation utilization
fr: Utilisation de la simulation

source: If you haven't follow the step of :ref:`Simulation Environment Installation <source/simulation:Simulation Environment Installation>`. you won't be able to use the simulation.
fr: Il est indispensable de suivre l’étape :ref:`d'installation de l’environnement <source/simulation:Simulation Environment Installation>` pour utiliser correctement la simulation.

source: Hardware features won't be accessible.
fr: Les fonctionnalités matérielles ne seront pas accessibles.

source: The simulation is a powerful tool which allow to test new programs directly on your computer which prevent to transfer new code on the robot.
fr: La simulation est un outil puissant qui permet de tester de nouveaux programmes directement sur votre ordinateur en évitant de transférer un nouveau code sur le robot.

source: It also helps for developing purpose → no need to transfer code, compile and restart the robot which is way slower than doing it on a desktop computer.
fr: Cela aide également à des fins de développement → aucun besoin de transférer du code, de compiler et de redémarrer le robot, ce qui est beaucoup plus lent que de le faire sur un ordinateur de bureau.

source: Without physics - Visualization
fr: Sans physique - Visualisation

source: The visualization happens with Rviz which is a powerful tool.
fr: La visualisation se fait avec Rviz qui est un outil particulièrement puissant.

source: Control with trackbar
fr: Contrôler avec Trackbar

source: This visualization allows an easy first control of the robot, and helps to understand joints disposal. You can access it by using the command: ::
fr: Cette visualisation permet un premier contrôle facile du robot et aide à comprendre la position des axes. Utiliser la commande pour y accéder : ::

source: Rviz should open with a window containing 6 trackbars. Each of these trackbars allows to control the corresponding joint.
fr: Rviz doit s'ouvrir avec une fenêtre contenant 6 trackbars. Chacune de ces trackbars permet de contrôler l'axe correspondant.

source: Example of trackbars use.
fr: Exemple d'utilisation des trackbars.

source: Control with ROS
fr: Contrôler via ROS

source: Not only Rviz can display the robot, it can also be linked with ROS controllers to show robot's actions from ROS commands!
fr: Non seulement Rviz peut afficher le robot, mais il peut également être lié aux contrôleurs ROS pour afficher les actions du robot à partir des commandes ROS !

source: This method can help you debugging ROS topics, services and also, API scripts.
fr: Cette méthode peut aider à débloquer des rubriques ROS, des services et également des scripts d'API.

source: To run it: ::
fr: Pour l'exécuter : ::

source: Rviz opening, with the robot ready to be controlled with ROS!
fr: L’ouverture de Rviz, avec le robot prêt à être contrôlé avec ROS !

source: With physics - Simulation
fr: Sans physique - Simulation

source: For the simulation, Ned uses Gazebo, a well known tool among the ROS community. It allows:
fr: Pour la simulation, Ned utilise Gazebo, un outil bien connu de la communauté ROS. Il permet :

source: Collision.
fr: La collision.

source: World creation → An virtual environment in which the robot can deal with objects.
fr: La création d’un monde → Un environnement virtuel dans lequel le robot peut manipuler des objets.

source: Gripper & Camera using.
fr: L’utilisation de la caméra et des Grippers.

source: The Niryo Gripper 1 has been replicated in Gazebo. The Camera is also implemented.
fr: Le Gripper Custom a été modélisé dans Gazebo. La caméra est également implémentée.

source: Gazebo also generates camera distortion, which brings the simulation even closer from the reality!
fr: Gazebo génère également une distorsion de la caméra, ce qui rapproche encore plus la simulation de la réalité !

source: Launch simulation
fr: Lancer une simulation

source: A specific world has been created to use Ned in Gazebo with 2 workspaces.
fr: Un monde spécifique a été créé pour utiliser Ned dans Gazebo avec 2 espaces de travail.

source: Gazebo view, with the robot ready to be controlled with ROS!
fr: Aperçu de Gazebo avec le robot prêt à être contrôlé avec ROS !

source: You can edit Gazebo world to do your own! It's placed in the folder *worlds* of the package niryo_robot_gazebo.
fr: Il est possible de modifier le monde Gazebo pour faire le vôtre ! Il est situé dans le dossier **mondes** du package niryo_robot_gazebo.

source: Simulation option
fr: Option de simulation

source: The user can disable 3 things by adding the specific string to the command line:
fr: L'utilisateur peut désactiver 3 choses en ajoutant la chaîne spécifique à la ligne de commande :

source: the Gazebo graphical interface: `gui:=false`.
fr: L'interface graphique Gazebo : `gui:=false`.

source: the Camera & the Gripper - Vision & Gripper wise functions won't be usable: `gripper_n_camera:=false`.
fr: La caméra et le Gripper - Les fonctions de vision et le Gripper ne seront pas utilisables : `gripper_n_camera:=false`.

source: Gazebo can be very slow. If your tests do not need Gripper and Camera, consider using Rviz to alleviate your CPU.
fr: Gazebo peut être très lent. Si vos tests ne nécessitent pas de Gripper ou de caméra, Il faut envisager d'utiliser Rviz pour alléger votre CPU.
